{
    "name": "en",
    "type": "lang",
    "vars":{
        "constructing": "Constructing",
        "constructing...": "Constructing...",
        "resumatesitetitle": "Resumate - Write Yor Page Using JSON!",
        "introline1": "Use JSON-based templates to render your page",
        "introline2": "PHP environment is the only thing you need!",
        "sitemenutitle": "Resumate",
        "sitemenuhome": "Home",
        "sitemenubasics": "Basics",
        "sitemenusitesdoc": "Pages",
        "sitemenutemplatesdoc": "Templates",
        "sitemenuhtmldoc": "HTML Elements",
        "whatisresumate": "What's Resumate?",
        "resumateintro": "Resumate is a tool allowing you to render HTML pages using JSON-based templates, which is convienient for occationally updated page with repeating elements (e.g.: a Ph.D. personal homepage with a list of publications, formatted with title, authors, description and link). Using Resumate, it is able to quote the template ten times and give title, authors, description and link easily, instead of copying and pasting HTML for ten times and insert those information in their repective places. Resumate also comes with multi-language and site theme support, so you don't need to worry about globalizing or beautifying your page.",
        "educationexp": "Example: Edu Experience",
        "educationphdstart": "Doctor of Juridical Science at Harvard University (Supervisor: ",
        "educationexampleprof": "Professor R. Sumate",
        "educationphdend": ") (2014-2019)",
        "educationms": "Master of Science in Computer Science at Yale University (2012-2014)",
        "educationbachelor": "Bachelor of Science in Mathematics at Brown University (2008-2012)",
        "educationdescription": "Above (including this paragraph) is rendered from <code>education</code> template of Resumate. I can provide 5 Macros: <code>edu_template_title</code>, <code>edu_template_phd</code>, <code>edu_template_master</code>, <code>edu_template_bachelor</code> and <code>edu_template_comment</code> to the template, and the renderer will figure out the right thing, since the format is pre-defined by the writer of the template already.",
        "codeforabove": "Code for Above",
        "codeforabovecodejsvar": "codeforabovecodeid",
        "codeforabovecode": "{\"name\":\"education\",\"vars\":{\"edu_template_title\":\"$educationexp$\",\"edu_template_phd\":[\"$educationphdstart$\",{\"name\":\"a\",\"attr\":{\"href\":\"https://resumate.io/\"},\"content\":[\"$educationexampleprof$\"]},\"$educationphdend$\"],\"edu_template_master\":\"$educationms$\",\"edu_template_bachelor\":\"$educationbachelor$\",\"edu_template_comment\":\"$educationdescription$\"}}",
        "samplecodeexplain": "Explaination",
        "samplecodeexplainmain": [
            "The code above quoted <code>education</code> template and passed those 5 Macros to the template. When Resumate is parsing templates, it will find the value for the Macro and print it on the page.",
            {
                "name": "ul",
                "attr": {
                    "style": {
                        "text-align": "left"
                    }
                },
                "content": [
                    ["<code>edu_template_title</code> is the title of this template, which quoted Macro <code>$educationexp$</code>: Use $ symbol at the start/end of the Macro name to request the value of the Macro. This Macro is defined in the language file, and Resumate will show different value for this Macro in different languages. In this language, its value is:“", "$educationexp$", "”."],
                    ["<code>edu_template_phd</code> is a place to show your Doctorate experience. Here, we provided a list containing <code>$educationphdstart$</code>, <code>a</code> template (to generate HTML links), and the final <code>$educationphdend$</code>. The list will be resolved by Resumate into an HTML string, then passed into <code>edu_template_phd</code>. You can also substitute this list using a single line with HTML, since Resumate will pass HTML strings transparently."],
                    ["<code>edu_template_ms</code> is a place to show your Masters experience. Similar to <code>edu_template_title</code>, the value of <code>$educationms$</code> will be passed to <code>edu_template_ms</code>。"],
                    ["<code>edu_template_bachelor</code> is a place to show your Bachelors experience. Similar to <code>edu_template_title</code>, the value of <code>$educationbachelor$</code> will be passed to <code>edu_template_bachelor</code>。"],
                    ["<code>edu_template_comment</code> is a place to elaborate a little bit more for your education experience. Similar to <code>edu_template_title</code>, the value of <code>$educationdescription$</code> will be passed to <code>edu_template_comment</code>。"]
                ]
            },
            "After Resumate resolves the template into HTML, it will be passed into its upper level (the Page or Block that requested it), and ultimately becomes a pure HTML page."
        ]
    }
}